let mas = [
	"Для того, чтобы спорить, нужны два глупца",
	"Кто ищет, тот всегда найдет…<br> если правильно ищет",
	"Если Чеширский кот улыбается,<br> значит, это кому-нибудь нужно",
	"Ты должен быть готов к тому,<br> что можешь быть неправ",
	"Чем больше мы узнаём мир,<br> тем больше мы его не знаем",
	"Мы плаваем в разных морях,<br> но выходим на тот же берег",
	"Хотите гарантий — купите тостер!",
	"Неудача — возможность узнать что-то новое",
	"Хочешь ходить по воде — научись сначала плавать",
	"Разрушь кости, и тело заживет.<br> Разрушь душу, и тело умрет…",
	"Проснитесь и пойте Мистер Фримен",
	"Я уже говорил тебе, что такое безумие, а?",
	"Зачем нужно жрать капусту, если есть картошка?",
	"Мой отец говорил:<br>«Голодные люди едят еду а скромные люди её подают»",
	"... Никто не в силах изменить уготованную судьбу",
	"... Я лишь исполнял предназначение",
	"Долг синоби – убивать,<br> но даже он не должен забывать о милосердии"
];
let masBg = ["b1", "b2", "b3", "b4", "b5", "b6", "b7", "b8", "b9", "b10", "b11", "b12", "b13", "b14", "b15", "b16"];
let masImg = [
	"https://i.postimg.cc/rp1DHbSd/1.png",
	"https://i.postimg.cc/B6NXSK74/2.png",
	"https://i.postimg.cc/ZRJWzccw/js2.png"
];

window.changeText = () => {
	document.querySelector("a").innerHTML = mas[random(0, mas.length - 1)];
	document.body.className = masBg[random(0, masBg.length - 1)];
	document.querySelector("img").src = masImg[random(0, masImg.length - 1)];
};

function random(min, max) {
	let rand = min - 0.5 + Math.random() * (max - min + 1);
	rand = Math.round(rand);
	return rand;
}
